Arellano1904/Texas-Instruments-TivaC/TM4C123GH6PM_develop/drivers/ili9341_tm4c123G.c
    // ── Bounds check ─────────────────────────────────────────────────────────
    // A character starting at x=236 would write pixels 236..243,
    // but the screen only goes to 239 → corrupts ILI9341 address counter.
    if (x + FONT_WIDTH > ILI9341_WIDTH)  return;
    if (y + FONT_HEIGHT > ILI9341_HEIGHT) return;

    // ── ASCII → font table index ─────────────────────────────────────────────
    // Your table starts at 0x20 (space), so:
    //   ' '  → index 0
    //   '!'  → index 1
    //   'A'  → index 33   (0x41 - 0x20)
    if (ch < (char)FONT_FIRST_CHAR || ch > (char)FONT_LAST_CHAR)
        ch = (char)FONT_FALLBACK;
    fontIdx = (uint8_t)((uint8_t)ch - FONT_FIRST_CHAR);

    // ── Expand bitmap → RGB565 pixels ─────────────────────────────────────────
    // Outer loop: rows top → bottom (row 0 = topmost screen row of glyph)
    // Inner loop: columns left → right
    // Memory layout in g_ui16CharBuf:
    //   [0..7]   = row 0  (top row of glyph,   8 pixels)
    //   [8..15]  = row 1
    //   ...
    //   [120..127] = row 15 (bottom row of glyph)
    // This is exactly the order ILI9341 expects after RAMWR
    // because we set a top-to-bottom window.
    for (row = 0; row < FONT_HEIGHT; row++)
    {
        fontByte = font8x16[fontIdx][row];

        for (col = 0; col < FONT_WIDTH; col++)
        {
            // Shift mask from MSB down: col0→bit7, col1→bit6 ... col7→bit0
            *pPix++ = (fontByte & (0x80u >> col)) ? fgColor : bgColor;
        }
    }

    // ── Set 8×16 window, fire DMA ─────────────────────────────────────────────
    // Window = exactly the character bounding box.
    // ILI9341 will auto-advance within this window — no address math needed.
    ili9341_set_window(x,y,x + FONT_WIDTH - 1, y + FONT_HEIGHT - 1);

    ili9341_enable();      // CS low
    ili9341_data_mode();   // DC high — pixel stream

    // Kick off DMA: 128 pixels × 16-bit = 256 bytes
    uDMA_spi3_send_buffer(g_ui16CharBuf, FONT_WIDTH * FONT_HEIGHT);

    // Must wait for BOTH DMA done AND shift register empty before
    // the next ili9341_set_window() call. set_window sends SPI commands
    // and if SSI is still shifting pixels you corrupt the pixel stream.
    while (MAP_uDMAChannelSizeGet(UDMA_CH15_SSI3TX | UDMA_PRI_SELECT));
    while (SSIBusy(SSI3_BASE));

    ili9341_disable();     // CS high
    
}

void ili9341_print_string(uint16_t x, uint16_t y,const char *str,uint16_t fgColor,uint16_t bgColor){
    uint16_t curX = x;
    uint16_t curY = y;

    while (*str != '\0')
    {
        char ch = *str++;

        // ── Newline ───────────────────────────────────────────────────────────
        if (ch == '\n')
        {
            curX  = x;          // Return to left margin (not column 0 — respects x)
            curY += FONT_HEIGHT;     // Drop one text row (16 pixels)
            if (curY + FONT_HEIGHT > ILI9341_HEIGHT) return;   // Off bottom → stop
            continue;
        }

        if (ch == '\r') continue;   // Ignore bare carriage return

        // ── Auto word-wrap ───────────────────────────────────────────────────
        // Don't let a character start where it would run past the right edge
        if (curX + FONT_WIDTH > ILI9341_WIDTH)
        {
            curX  = x;
            curY += FONT_HEIGHT;
            if (curY + FONT_HEIGHT > ILI9341_HEIGHT) return;
        }

        ili9341_draw_char(curX, curY, ch, fgColor, bgColor);
        curX += FONT_WIDTH;    // Advance cursor one glyph width
    }
} 

void ili9341_print_int(uint16_t x, uint16_t y,int32_t num,uint16_t color, uint16_t bg){
    char buf[12];   // "-2147483648" + '\0' = 12 bytes
    intToStr(num, buf);
    ili9341_print_string(x,y,buf,color,bg);
}

void ili9341_print_float(uint16_t x, uint16_t y,float num, uint8_t decimals,uint16_t color, uint16_t bg){
    // '-' + up to 10 integer digits + '.' + decimals + '\0'.
    // Clamp decimals so the result always fits the buffer.
    char buf[24];
    if (decimals > 9) decimals = 9;
    floatToStr(num, buf,decimals);
    ili9341_print_string(x,y,buf,color,bg);
}

// spi3 for display //
void spi3_config(void){
    // Enable SSI3, PORT_D and PORT_B //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_SSI3));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOD));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOB));

    // Configure GPIO Port D pins 0 and 3 to be used as SSI
    MAP_GPIOPinTypeSSI(GPIO_PORTD_BASE,GPIO_PIN_0 | GPIO_PIN_3);

    // Configure PD0, PD3 for SSI3 (CLK, TX) //
    MAP_GPIOPinConfigure(GPIO_PD0_SSI3CLK); 
    MAP_GPIOPinConfigure(GPIO_PD3_SSI3TX);

    // Configure ChipSelect (CS-PD1) and DataComand (DC-PD2) pins  //
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, GPIO_PIN_1 | GPIO_PIN_2);

    // Configure RESET pin (PB5) //
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE,  GPIO_PIN_5);

    // Configure the SSI3 as SPI MODE0, 16-bit frames, 30 MHz bit clock //
    MAP_SSIConfigSetExpClk(SSI3_BASE,MAP_SysCtlClockGet(),SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,30000000,16);
    // Enabling the SSI3 module //
    MAP_SSIEnable(SSI3_BASE);
}

void spi3_data_len(uint32_t len){
    MAP_SSIDisable(SSI3_BASE);
    MAP_SSIConfigSetExpClk(SSI3_BASE, systemClkFreq, SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,30000000, len);
    MAP_SSIEnable(SSI3_BASE);
}

// uDMA //
void uDMA_spi3_config(void){
    // Enable uDMA peripheral
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_UDMA));

    // Enable uDMA controller
    MAP_uDMAEnable();

    // Set base address of control table
    MAP_uDMAControlBaseSet(uDMAControlTable);

    // Enable uDMA on SSI3 TX
    MAP_SSIDMAEnable(SSI3_BASE, SSI_DMA_TX);

    // Optional but safe
    MAP_uDMAChannelAssign(UDMA_CH15_SSI3TX);

    // Disable channel before configuration
    MAP_uDMAChannelDisable(UDMA_CH15_SSI3TX);

